app/controllers/campings_controller.rb

  def index
    @searching = params[:search]
    searched = Campground.search(@searching)
    @campgrounds = searched.page(params[:page]).per(5)
---
SELECT  "campgrounds".* FROM "campgrounds" WHERE (name LIKE '%%') LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "campgrounds" WHERE (name LIKE '%%')

  def set_campground
    @campground = Campground.find(params[:id])
---
SELECT  "campgrounds".* FROM "campgrounds" WHERE "campgrounds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]