app/controllers/campgrounds_controller.rb

SELECT  "campgrounds".* FROM "campgrounds" WHERE "campgrounds"."status" = ? LIMIT ? OFFSET ?  [["status", "t"], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 FROM "campgrounds" WHERE "campgrounds"."status" = ? LIMIT ? OFFSET ?) subquery_for_count  [["status", "t"], ["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    @searching = params[:search].present? ? params[:search]: nil
    if @searching
      # searched = Campground.search(@searching)
      # searched = searched.select{|x| x.status == true } #filtro todos los que tienen estado available
      searched = Campground.where(name: @searching, status: true)
    else
      searched = Campground.where(status: true)
    end
    @campgrounds = searched.page(params[:page]).per(5)

INSERT INTO "campgrounds" ("name", "direction", "region", "photo", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", ""], ["direction", ""], ["region", ""], ["photo", "header1.jpg"], ["created_at", "2018-04-26 00:34:42.922499"], ["updated_at", "2018-04-26 00:34:42.922499"], ["user_id", 22]]
---
  def create
    campground = Campground.new(campground_params)
    campground.user_id = current_user.id
    campground.save!

UPDATE "campgrounds" SET "status" = ?, "updated_at" = ? WHERE "campgrounds"."id" = ?  [["status", "t"], ["updated_at", "2018-04-17 00:51:05.792823"], ["id", 180]]
---
  def campground_status
    if @campground.status == true
      @campground.update(status: false)

UPDATE "campgrounds" SET "direction" = ?, "updated_at" = ? WHERE "campgrounds"."id" = ?  [["direction", "9289 Carroll Tunnel2"], ["updated_at", "2018-04-13 00:48:01.228833"], ["id", 172]]
---
  def update
    respond_to do |format|
      if @campground.update(campground_params)

SELECT "campgrounds".* FROM "campgrounds" WHERE "campgrounds"."id" IN (22, 24, 25, 26, 29, 40, 21, 30, 32, 33, 34, 27, 35, 36, 38, 28, 39, 23, 31, 37)
---
  def set_campground
    @campground = Campground.find(params[:id])