app/controllers/users_controller.rb

  def my_campgrounds
    @mycampgrounds = Campground.where(user_id: current_user)
---
SELECT "campgrounds".* FROM "campgrounds" WHERE "campgrounds"."user_id" = 104